app/controllers/quotes_controller.rb

SELECT  "quotes".* FROM "quotes" ORDER BY "quotes"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @quote = Quote.order("RANDOM()").first

INSERT INTO "quotes" ("saying", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["saying", "A fool sees not the same tree that a wise man sees."], ["author", "William Blake"], ["created_at", "2017-05-17 20:30:53.044716"], ["updated_at", "2017-05-17 20:30:53.044716"]]
---
  def create
    @quote = Quote.create(quote_params)